Tekla.Structures.Catalogs.ShapeItem.AppendMetadata(System.Collections.Generic.IList{System.Tuple{System.String,System.String}})
Appends metadata key-value pairs to the shape information. I
keyValPairs: A list of the key-value pairs that define the metatadata to be added
public void InsertAndAddMetadataTest()
{
// NOTE: replace "[" and "]" with smaller than and larger than characters,
// had to be done like this due to doxygen XML clashing with C# syntax
var polymesh = CreateSomeValidBrep();
var shapeItem = new ShapeItem
{
Name = "TestFileName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
var testPairs = new List [Tuple[string, string]]
{
new Tuple[string, string] ("TestTAG", "testval"),
new Tuple[string, string] ("Volume", "1.01")
};
shapeItem.AppendMetadata(testPairs);
}
Returns:
True on success. Will return false and not add any metadata if even one key is empty.